{
    "Bienvenido": "Welcome",
    "Descripcion": "I am a fullstack developer with a special focus on user experience. In this section, you can explore three of my most representative projects. I hope you enjoy them!",
    "NombreProyecto_PokemonApp": "Pokedex",
    "DescripcionProyecto_PokemonApp": "A comprehensive Pokémon Pokédex that allows you to explore in-depth, relevant, detailed, and useful data available for learning.",
    "NombreProyecto_DepositPredictor": "Deposit Predictor",
    "DescripcionProyecto_DepositPredictor": "Web application with Machine Learning to predict fixed-term deposit acceptance, using Random Forest and interactive charts",
    "NombreProyecto_PanelAdminApp": "Admin Panel",
    "DescripcionProyecto_PanelAdminApp": "Admin panel in Flask (MVC) with an interactive dashboard and user management with role control. Modular and scalable.",
    "DemostracionVivo" : "Demo",
    "TituloFormulario": "Contact Form",
    "NombreCompania": "Name / Company",
    "CorreoContacto": "Contact Email",
    "Mensaje": "Message",
    "Enviar": "Send",
    "Educacion": "Education",
    "Trabajo": "Work Experience",
    "Universidad": "University of Talca, Talca, Chile.",
    "Ingeniero": "Business Informatics Engineer",
    "ExperienciaLaboralEducativa": "Educational Work Experience",
    "AyudanteTi": "Information Technology Teaching Assistant",
    "Certificados": "Degrees and Certifications",
    "AyudanteEstrategia": "Business Strategy Teaching Assistant",
    "NombreLicencia": "Bachelor of Science in Management and Information Technologies",
    "CertificadoZendesk": "Zendesk Support Certified Expert I",
    "DescargarDocumento": "Download Document",
    "TituloUniversitario": "Mauricio Garrido - University Degree",
    "LicenciaturaUniversitaria": "Mauricio Garrido - Bachelor's Degree",
    "Proyectos": "Projects",
    "Habilidades": "Skills",
    "Contacto": "Contact",
    "Curriculum": "Resume",
    "DescripcionBankPredictor": "<h3>Overview</h3><p>The Predictive Banking App is a web application designed to predict whether a customer will accept or reject a fixed deposit based on their financial profile. It leverages a <strong>Random Forest</strong> model trained on real banking data, including key features such as age, job, marital status, and account balance. This tool helps banks and financial institutions anticipate customer behavior and make data-driven decisions.</p><h3>Main Features</h3><ul><li><strong>Intuitive Interface:</strong> Users can easily input customer data.</li><li><strong>Real-Time Predictions:</strong> The model processes the entered data and predicts whether the customer will accept or reject the deposit.</li><li><strong>Graphical Visualization:</strong> Results are displayed interactively using <strong>donut</strong> charts powered by Chart.js.</li><li><strong>Data Analysis:</strong> Provides insights into the factors influencing customer decisions.</li><li><strong>Speed and Optimization:</strong> The Machine Learning model is optimized for fast and accurate predictions.</li></ul><h3>Technologies Used</h3><ul><li><strong>Frontend:</strong> Bootstrap, FontAwesome, Chart.js, CSS.</li><li><strong>Backend:</strong> Python 3.13, Flask, Pandas, Scikit-learn.</li><li><strong>Database:</strong> CSV files processed with Pandas.</li></ul><h3>Use Cases</h3><ul><li>Banks can assess the likelihood of customers accepting fixed deposits.</li><li>Financial institutions can tailor offers based on customer profiles.</li><li>Researchers can analyze trends in financial product adoption.</li></ul>",
    "DescripcionPokedex": "<h3>Description</h3><p>The Pokédex is a web application that allows users to explore and learn in detail about all Pokémon, including their stats, abilities, types, and moves. Additionally, users can view detailed information about each move, such as power, accuracy, and secondary effects. To ensure accurate and up-to-date data, the application utilizes the <strong>Pokémon API</strong>, providing official and comprehensive information.</p><h3>Main Features</h3><ul><li><strong>Complete Pokémon List:</strong> Access all Pokémon with details on base stats, types, abilities, and evolutions.</li><li><strong>Move Exploration:</strong> Detailed information about each move, including type, power, accuracy, and additional effects.</li><li><strong>Interactive and Dynamic Interface:</strong> Smooth navigation and optimized design for easy exploration.</li><li><strong>Quick Search:</strong> Allows filtering Pokémon by name, type, or ability.</li><li><strong>Responsive Design:</strong> The application is fully responsive and adapts to any screen size.</li></ul><h3>Technologies Used</h3><ul><li><strong>Frontend:</strong> React, Bootstrap, CSS.</li><li><strong>Backend:</strong> JavaScript.</li><li><strong>API:</strong> Pokémon API to retrieve real-time data.</li></ul>",
    "DescripcionAdminPanel": "<h3>Description</h3><p>MG Admin is a base admin panel designed as a foundation for other projects. It provides essential modules for user, role, and permission management, along with a Dashboard displaying key system information. Its modular and scalable architecture allows easy adaptation to various requirements.</p><h3>Main Features</h3><ul><li><strong>Interactive Dashboard:</strong> Displays general statistics, including the total number of registered users.</li><li><strong>User Management:</strong> Allows creating, editing, deleting, and viewing users.</li><li><strong>Role and Permission Management:</strong> Assigns custom roles and permissions to control user access.</li><li><strong>Security and Authentication:</strong> Implements secure session management with Flask.</li><li><strong>Dynamic Interface:</strong> Responsive design optimized with Bootstrap and DataTables.js for a better user experience.</li></ul><h3>Technologies Used</h3><ul><li><strong>Backend:</strong> Python, Flask.</li><li><strong>Frontend:</strong> JavaScript, Bootstrap, CSS.</li><li><strong>Additional Libraries:</strong> SweetAlert2 for interactive alerts, FontAwesome for icons, Chart.js for statistical graphs, and DataTables.js for interactive tables.</li><li><strong>Database:</strong> Supabase.</li></ul>",
   
    "Responsabilidades": "Responsibilities",
    "ExperiencesCompanyZerviZ": "ZerviZ",
    "ExperiencesRoleZerviZ": "Zendesk Solutions Consultant & Developer",
    "ExperiencesYearsZerviZ": "November 2021 - April 2023",
    "ExperiencesZendeskConfigurationZerviZ": "Customized and configured Zendesk to optimize user support and operational efficiency.",
    "ExperiencesClientMeetingsZerviZ": "Held meetings with clients to gather requirements and execute tailored configurations.",
    "ExperiencesApplicationDevelopmentZerviZ": "Developed custom applications for Zendesk using React and client-provided APIs.",
    "ExperiencesDataExtractionETLZerviZ": "Extracted and processed data using Python and Pandas, implementing ETL processes for data visualization.",
    
    "ExperiencesCompanyKamaleon": "Kamaleon",
    "ExperiencesRoleKamaleon": "Fullstack Developer",
    "ExperiencesYearsKamaleon": "December 2020 - November 2021",
    "ExperiencesDatabaseDesignKamaleon": "Designed and implemented SQL database structures based on client requirements.",
    "ExperiencesFrontEndDevelopmentKamaleon": "Developed user interfaces using JavaScript, React, and Bootstrap.",
    "ExperiencesBackEndDevelopmentKamaleon": "Built server-side logic with PHP to ensure efficient back-end performance.",
    
    "ExperiencesCompanyFreelance": "Freelance Web Development & Zendesk Consulting",
    "ExperiencesRoleFreelance": "Freelancer",
    "ExperiencesYearsFreelance": "May 2023 - Present",
    "ExperiencesProjectDevelopmentFreelance": "Designed personal projects using React, Python, and API integration.",
    "ExperiencesZendeskConsultancyFreelance": "Configured integrations, SLAs, and optimized Zendesk setups for various clients.",
    "ExperiencesDataExtractionETLFreelance": "Led data extraction and ETL processes to improve clients' data analysis capabilities."
    
    
      
}
  