{
    "Bienvenido": "Bienvenido",
    "Descripcion": "Soy un desarrollador fullstack con un enfoque especial en la experiencia del usuario. En esta sección, puedes explorar tres de mis proyectos más representativos. ¡Espero que los disfrutes!",
    "NombreProyecto_PokemonApp": "Pokedex",
    "DescripcionProyecto_PokemonApp": "Una completa Pokédex de Pokémon que te permite explorar detalladamente datos relevantes y útiles disponibles para su aprendizaje.",
    "NombreProyecto_DepositPredictor": "Deposit Predictor",
    "DescripcionProyecto_DepositPredictor": "Aplicación web con Machine Learning para predecir la aceptación de depósitos a plazo fijo, utilizando Random Forest y gráficos interactivos.",
    "NombreProyecto_PanelAdminApp": "Panel de administrador",
    "DescripcionProyecto_PanelAdminApp": "Panel de administración en Flask (MVC) con dashboard interactivo y gestión de usuarios con control de roles. Modular y escalable.",
    "DemostracionVivo" : "Demo",
    "TituloFormulario": "Formulario de Contacto",
    "NombreCompania" : "Nombre / Compañía",
    "CorreoContacto" : "Correo de Contacto",
    "Mensaje" : "Mensaje",
    "Enviar": "Enviar",
    "Educacion": "Educación",
    "Trabajo": "Experiencia Laboral",
    "Universidad": "Universidad de Talca, Talca, Chile.",
    "Ingeniero": "Ingeniero Informático Empresarial.",
    "ExperienciaLaboralEducativa": "Experiencia Laboral Educativa",
    "AyudanteTi": "Ayudante de Cátedra Tecnologías de Información.",
    "Certificados": "Títulos y Certificaciones",
    "AyudanteEstrategia": "Ayudante de Cátedra de Estrategia de Negocios.",
    "NombreLicencia": "Licenciado en Ciencias de la Gestión y Tecnologías de la Información.",
    "CertificadoZendesk": "Certificado Zendesk Support Certified Expert I",
    "DescargarDocumento": "Descargar Documento",
    "TituloUniversitario": "Mauricio Garrido - Titulo Universitario",
    "LicenciaturaUniversitaria": "Mauricio Garrido - Licenciatura",
    "Proyectos": "Proyectos",
    "Habilidades": "Habilidades",
    "Contacto": "Contacto",
    "Curriculum": "Curriculum",
    "DescripcionBankPredictor": "<h3>Descripción</h3><p>La Predictive Banking App es una aplicación web diseñada para predecir si un cliente aceptará o rechazará un depósito a plazo fijo basado en su perfil financiero. Utiliza un modelo de <strong>Random Forest</strong> entrenado con datos bancarios reales, incluyendo características como edad, trabajo, estado civil, saldo bancario, entre otros factores clave. Esta herramienta permite a los bancos y entidades financieras anticipar el comportamiento de los clientes y mejorar la toma de decisiones.</p><h3>Características Principales</h3><ul><li><strong>Interfaz Intuitiva:</strong> Permite a los usuarios ingresar datos de clientes de manera sencilla.</li><li><strong>Predicciones en Tiempo Real:</strong> El modelo analiza los datos ingresados y predice si el cliente aceptará o rechazará el depósito.</li><li><strong>Visualización Gráfica:</strong> Los resultados se muestran de manera interactiva con gráficos de tipo <strong>donut</strong> generados con Chart.js.</li><li><strong>Análisis de Datos:</strong> Ofrece una vista detallada de los factores que influyen en la decisión del cliente.</li><li><strong>Optimización y Velocidad:</strong> El modelo de Machine Learning está optimizado para procesar datos rápidamente y generar predicciones precisas.</li></ul><h3>Tecnologías Utilizadas</h3><ul><li><strong>Frontend:</strong> Bootstrap, FontAwesome, Chart.js, CSS.</li><li><strong>Backend:</strong> Python 3.13, Flask, Pandas, Scikit-learn.</li><li><strong>Base de Datos:</strong> Archivos CSV procesados con Pandas.</li></ul><h3>Casos de Uso</h3><ul><li>Bancos pueden evaluar la probabilidad de aceptación de depósitos a plazo fijo por parte de los clientes.</li><li>Instituciones financieras pueden personalizar ofertas según el perfil de cada cliente.</li><li>Investigadores pueden utilizar la herramienta para analizar tendencias en la aceptación de productos financieros.</li></ul>",
    "DescripcionPokedex": "<h3>Descripción</h3><p>La Pokédex es una aplicación web que permite explorar y conocer en detalle a todos los Pokémon, incluyendo sus estadísticas, habilidades, tipos y movimientos. Además, los usuarios pueden consultar información detallada sobre cada movimiento, incluyendo su poder, precisión y efectos secundarios. Para obtener datos actualizados y precisos, la aplicación utiliza la <strong>API de Pokémon</strong>, lo que garantiza información oficial y completa.</p><h3>Características Principales</h3><ul><li><strong>Listado Completo de Pokémon:</strong> Acceso a todos los Pokémon con detalles sobre sus estadísticas base, tipos, habilidades y evoluciones.</li><li><strong>Exploración de Movimientos:</strong> Información detallada sobre cada movimiento, incluyendo tipo, poder, precisión y efectos adicionales.</li><li><strong>Interfaz Interactiva y Dinámica:</strong> Navegación fluida y diseño optimizado para explorar la información fácilmente.</li><li><strong>Búsqueda Rápida:</strong> Permite filtrar Pokémon por nombre, tipo o habilidad.</li><li><strong>Diseño Adaptativo:</strong> La aplicación es responsive y se adapta a cualquier tamaño de pantalla.</li></ul><h3>Tecnologías Utilizadas</h3><ul><li><strong>Frontend:</strong> React, Bootstrap, CSS.</li><li><strong>Backend:</strong> JavaScript.</li><li><strong>API:</strong> Pokémon API para obtener datos en tiempo real.</li></ul>",
    "DescripcionAdminPanel": "<h3>Descripción</h3><p>MG Admin es un panel de administración base diseñado para servir como estructura para otros proyectos. Proporciona módulos esenciales para la gestión de usuarios, roles y permisos, además de un Dashboard con información clave del sistema. Su arquitectura modular y escalable permite adaptarlo a diversas necesidades.</p><h3>Características Principales</h3><ul><li><strong>Dashboard Interactivo:</strong> Muestra estadísticas generales, incluyendo el total de usuarios registrados en el sistema.</li><li><strong>Gestión de Usuarios:</strong> Permite la creación, edición, eliminación y visualización de usuarios.</li><li><strong>Gestión de Roles y Permisos:</strong> Asigna roles y permisos personalizados a cada usuario para controlar el acceso a diferentes funciones del sistema.</li><li><strong>Seguridad y Autenticación:</strong> Implementación de gestión de sesiones segura con Flask.</li><li><strong>Interfaz Dinámica:</strong> Diseño responsivo y optimizado con Bootstrap y DataTables.js para una mejor experiencia de usuario.</li></ul><h3>Tecnologías Utilizadas</h3><ul><li><strong>Backend:</strong> Python, Flask.</li><li><strong>Frontend:</strong> JavaScript, Bootstrap, CSS.</li><li><strong>Librerías Adicionales:</strong> SweetAlert2 para alertas interactivas, FontAwesome para iconos, Chart.js para gráficos estadísticos, y DataTables.js para tablas interactivas.</li><li><strong>Base de Datos:</strong> Supabase.</li></ul>",
    
    "Responsabilidades": "Responsabilidades",
    "ExperiencesCompanyZerviZ": "ZerviZ",
    "ExperiencesRoleZerviZ": "Consultor de Soluciones Zendesk & Desarrollador",
    "ExperiencesYearsZerviZ": "Noviembre 2021 - Abril 2023",
    "ExperiencesZendeskConfigurationZerviZ": "Personalicé y configuré Zendesk para optimizar el soporte al usuario y la eficiencia operativa.",
    "ExperiencesClientMeetingsZerviZ": "Realicé reuniones con clientes para recopilar requisitos y ejecutar configuraciones personalizadas.",
    "ExperiencesApplicationDevelopmentZerviZ": "Desarrollé aplicaciones personalizadas para Zendesk usando React y APIs proporcionadas por el cliente.",
    "ExperiencesDataExtractionETLZerviZ": "Extraje y procesé datos utilizando Python y Pandas, implementando procesos ETL para la visualización de datos.",
    
    "ExperiencesCompanyKamaleon": "Kamaleon",
    "ExperiencesRoleKamaleon": "Desarrollador Fullstack",
    "ExperiencesYearsKamaleon": "Diciembre 2020 - Noviembre 2021",
    "ExperiencesDatabaseDesignKamaleon": "Diseñé e implementé estructuras de base de datos SQL según los requisitos del cliente.",
    "ExperiencesFrontEndDevelopmentKamaleon": "Desarrollé interfaces de usuario con JavaScript, React y Bootstrap.",
    "ExperiencesBackEndDevelopmentKamaleon": "Construí la lógica del servidor con PHP para asegurar un rendimiento eficiente del back-end.",
    
    "ExperiencesCompanyFreelance": "Desarrollo web Independiente y Consultoría de Zendesk",
    "ExperiencesRoleFreelance": "Freelancer",
    "ExperiencesYearsFreelance": "Mayo 2023 - Actualidad",
    "ExperiencesProjectDevelopmentFreelance": "Diseñé proyectos personales usando React, Python e integración de APIs.",
    "ExperiencesZendeskConsultancyFreelance": "Configuré integraciones, SLAs y optimicé configuraciones de Zendesk para varios clientes.",
    "ExperiencesDataExtractionETLFreelance": "Lideré procesos de extracción y ETL para mejorar las capacidades de análisis de datos de los clientes."
    

}